In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(r'./example.db')
def ppsql(q):
    return pd.read_sql_query(q,sqlite3.connect(r'./example.db'))

In [4]:
ppsql("""-- Select name from people and sort alphabetically
Select name from people order by name""").head()

                 name
0             50 Cent
1  A. Michael Baldwin
2       A. Raven Cruz
3        A.J. Buckley
4        A.J. DeLucia

In [5]:
ppsql("""-- Select the title and duration from longest to shortest film
Select title, duration from films order by duration desc;""").head()

                      title  duration
0                    Carlos     334.0
1       Blood In, Blood Out     330.0
2             Heaven's Gate     325.0
3  The Legend of Suriyothai     300.0
4                  Das Boot     293.0

In [6]:
ppsql("""-- Select the release year, duration, and title sorted by release year and duration
Select release_year, duration, title from films order by 1,2;""").head()

   release_year  duration                    title
0           NaN       NaN               Wolf Creek
1           NaN      22.0              10,000 B.C.
2           NaN      22.0         Anger Management
3           NaN      24.0                 Lovesick
4           NaN      24.0  Yu-Gi-Oh! Duel Monsters

In [7]:
ppsql("""-- Select the certification, release year, and title sorted by certification and release year
Select certification, release_year, title from films order by 1,2;""").head()

  certification  release_year             title
0          None           NaN       10,000 B.C.
1          None           NaN  A Touch of Frost
2          None           NaN  Anger Management
3          None           NaN    Animal Kingdom
4          None           NaN         BrainDead

In [9]:
ppsql("""-- Find the release_year and film_count of each year
select release_year, count(title) as film_count from films group by release_year;""").tail()

    release_year  film_count
87        2012.0         220
88        2013.0         236
89        2014.0         252
90        2015.0         226
91        2016.0         106

In [10]:
ppsql("""-- Find the release_year and average duration of films for each year
select release_year , avg(duration) as avg_duration from films group by release_year;""").tail()

    release_year  avg_duration
87        2012.0    106.000000
88        2013.0    108.140426
89        2014.0    105.426295
90        2015.0    106.098214
91        2016.0    109.632075

In [12]:
ppsql("""-- Find the release_year, country, and max_budget, then group and order by release_year and country
select release_year,country, max(budget) as max_budget from films group by release_year, country;""").tail()

     release_year      country   max_budget
500        2016.0       Mexico    3000000.0
501        2016.0       Panama   20000000.0
502        2016.0  South Korea   12620000.0
503        2016.0           UK  175000000.0
504        2016.0          USA  250000000.0

In [15]:
ppsql("""select release_year, count(distinct language) 
      from films group by release_year order by count(distinct language) desc""").head()

   release_year  count(distinct language)
0        2006.0                        16
1        2015.0                        15
2        2005.0                        14
3        2013.0                        13
4        2008.0                        13

In [16]:
ppsql("""-- Select the country and distinct count of certification as certification_count
select country, count(distinct(certification)) as certification_count from films
-- Group by country
Group by country
-- Filter results to countries with more than 10 different certifications
having count(distinct(certification)) >10;
""")

  country  certification_count
0     USA                   12

In [27]:
ppsql("""-- Select the country and average_budget from films
Select country, round(avg(budget),2) as average_budget from films
-- Group by country
group by country
-- Filter to countries with an average_budget of more than one billion
having avg(budget) >1000000000
-- Order by descending order of the aggregated budget
order by avg(budget);""")

       country  average_budget
0      Hungary    1.260000e+09
1  South Korea    1.383960e+09

In [26]:
pd.options.display.float_format = None
pd.options.display.max_colwidth = None

In [30]:
ppsql("""-- Select the release_year for films released after 1990 grouped by year
Select release_year from films where release_year > 1990 group by release_year;""").count()

release_year    26
dtype: int64

In [32]:
ppsql("""-- Modify the query to also list the average budget and average gross
SELECT release_year, avg(budget) as avg_budget, avg(gross) as avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year;""").tail()

    release_year    avg_budget     avg_gross
21        2012.0  4.133182e+07  6.287353e+07
22        2013.0  4.051904e+07  5.615836e+07
23        2014.0  3.532580e+07  6.241214e+07
24        2015.0  3.929833e+07  7.257330e+07
25        2016.0  5.664274e+07  7.692404e+07

In [33]:
ppsql("""SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year
-- Modify the query to see only years with an avg_budget of more than 60 million
having AVG(budget)>60000000;""")

   release_year    avg_budget     avg_gross
0        2005.0  7.032394e+07  4.115914e+07
1        2006.0  9.396893e+07  3.923786e+07

In [35]:
ppsql("""SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year
HAVING AVG(budget) > 60000000
-- Order the results from highest to lowest average gross and limit to one
Order by avg_gross desc
limit 2;""")

   release_year    avg_budget     avg_gross
0        2005.0  7.032394e+07  4.115914e+07
1        2006.0  9.396893e+07  3.923786e+07